{
  "tasks": [
    {
       "id":1,
       "title":"Secure File Transfer Tool",
       "description":"Develop a CLI tool in Python that encrypts files (AES-256) before transferring them over SFTP/SCP. Include checksum verification and a logging system for failed transfers.",
       "author":"Benjamin Hayes",
       "img": "/img/guy1.png"
    },
    {
       "id":2,
       "title":"Server Health Dashboard",
       "description":"Build a web-based dashboard (React + Flask) displaying real-time server metrics (CPU, RAM, disk space) fetched from Prometheus. Add alerting for critical thresholds.",
       "author":"Brandon Pierce",
       "img": "/img/guy2.png"
    },
    {
       "id":3,
       "title":"Password Manager CLI",
       "description":"TCreate a command-line password manager in Python that stores credentials securely (SQLite + bcrypt), allows generation of strong passwords, and supports search/export.",
       "author":"Jason Reedch",
       "img": "/img/guy3.png"
    },
    {
       "id":4,
       "title":"Automated Incident Response Bot",
       "description":"Develop a Slack/Discord bot that triggers IT incident workflows (e.g., restart services, notify teams) based on alerts from monitoring tools like Zabbix or PagerDuty.",
       "author":"Anthony Russo",
       "img": "/img/guy4.png"
    },
    {
       "id":5,
       "title":"Wi-Fi Security Auditor",
       "description":"Write a Python script that scans nearby Wi-Fi networks, checks for weak encryption (WEP/WPA2), and flags vulnerable devices using scapy.",
       "author":"Leonardo Santos",
       "img": "/img/guy5.png"
    },
    {
       "id":6,
       "title":"Dark Web Monitoring Tool",
       "description":"Create a script that checks leaked credential databases (via HaveIBeenPwned API) and alerts users if their emails/passwords appear in breaches.",
       "author":"Sophie Bennett",
       "img": "/img/female1.png"
    },
    {
       "id":7,
       "title":"Cloud Cost Optimizer",
       "description":"Build a tool (AWS SDK/Boto3) to identify idle EC2 instances, underutilized RDS databases, and suggest cost-saving measures.",
       "author":"Abigail Stone",
       "img": "/img/female2.png"
    },
    {
       "id":8,
       "title":"Log Anomaly Detector.",
       "description":"Design a Python script using ML (scikit-learn) to detect unusual patterns in server logs (e.g., brute-force attacks) and flag them for review.",
       "author":"Asher Bennett",
       "img": "/img/guy4.png"
    },
    {
       "id":9,
       "title":"Kubernetes Auto-Healing System",
       "description":"Develop a Helm chart that automatically restarts failed pods, scales deployments based on CPU, and notifies Slack if crashes persist.",
       "author":"Matteo Rossi ",
       "img": "/img/guy5.png"
    },
    {
       "id":10,
       "title":"Multi-Factor Auth (MFA) Bypass Tester",
       "description":"Create a penetration testing tool that simulates MFA bypass techniques (e.g., session hijacking) to assess vulnerability in web apps.",
       "author":"Ronan Blake",
       "img": "/img/guy1.png"
    }
 ]
}